#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

data.cloudflare_accounts.account_search: Reading...
data.cloudflare_zones.zone_search: Reading...
data.cloudflare_zones.zone_search: Read complete after 1s [name=pascaliske.dev]
data.cloudflare_zone.zone: Reading...
data.cloudflare_accounts.account_search: Read complete after 1s [name=Pascal Iske]
data.cloudflare_account.account: Reading...
data.cloudflare_zone.zone: Read complete after 1s
cloudflare_dns_record.dkim: Refreshing state... [id=c318f9e1465c4f33e52cbb14713311e5]
cloudflare_dns_record.next_ipv6: Refreshing state... [id=9c3b3926aef1e73291ba9c363e79c108]
cloudflare_dns_record.bimi: Refreshing state... [id=343168ec6ec621d98d7f3c21812f9ffb]
cloudflare_dns_record.mail_lockdown: Refreshing state... [id=a0d4e7bfade553ccfef588b010ba823f]
cloudflare_dns_record.bluesky: Refreshing state... [id=8b2806a3a311a5b28fdae58c0806b976]
cloudflare_dns_record.spf: Refreshing state... [id=f45826d2d351bb30c98bc916a6c1a8d0]
cloudflare_dns_record.google: Refreshing state... [id=6752099686cc4ba30a0c6ab61efc57d5]
cloudflare_dns_record.openpgpkey: Refreshing state... [id=9d39803fea1161900eadb3ec265d56f6]
cloudflare_dns_record.production_www_ipv4: Refreshing state... [id=f7d23497a2fe25a4152ca4d0b4773a34]
data.cloudflare_account.account: Read complete after 1s
cloudflare_dns_record.have_i_been_pwned: Refreshing state... [id=fd40066a24b3b54b37c2e846f929e761]
cloudflare_dns_record.production_ipv4: Refreshing state... [id=f6da7cf81e26104ddcc6c4d5d445a8c9]
cloudflare_dns_record.production_ipv6: Refreshing state... [id=6e15ba5c162a9aaf0b0169b4742dd564]
cloudflare_page_rule.redirect_www: Refreshing state... [id=de24c0e6fe1e3381e54bd62acb103adf]
cloudflare_dns_record.production_www_ipv6: Refreshing state... [id=097b10faaf70d2dd40099ae8f1ce0b6f]
cloudflare_dns_record.mail: Refreshing state... [id=0a7cf42fee140ef2c515f7e244b79b62]
cloudflare_dns_record.next_ipv4: Refreshing state... [id=4c7264671b72dccd05af23471ba88f43]
cloudflare_dns_record.dmarc: Refreshing state... [id=a1a8eac1293bae6f6d1aa2462c85fd6a]
cloudflare_list.redirect_legacy_pages: Refreshing state... [id=834ea16ce6424b70b066002e7f8a5269]
cloudflare_list_item.redirect_legacy_imprint: Refreshing state... [id=6578d80ee6e84ff587f4a28b78d65365]
cloudflare_list_item.redirect_legacy_about: Refreshing state... [id=aa5dc67dd1494f74b43e060c9e479075]
cloudflare_list_item.redirect_legacy_privacy: Refreshing state... [id=069a36a5a93d4470a58e692411995e70]
cloudflare_ruleset.redirect_legacy_pages: Refreshing state... [id=ebbbaa274a264aa8a843931e56568ea0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_list_item.redirect_legacy_about will be created
  + resource "cloudflare_list_item" "redirect_legacy_about" {
      + account_id   = "8d679dc8356c467df23c2a56c4f2fb2a"
      + comment      = "/about -> /home"
      + created_on   = (known after apply)
      + id           = (known after apply)
      + list_id      = "834ea16ce6424b70b066002e7f8a5269"
      + modified_on  = (known after apply)
      + operation_id = (known after apply)
      + redirect     = {
          + include_subdomains    = false
          + preserve_path_suffix  = false
          + preserve_query_string = false
          + source_url            = "pascaliske.dev/about"
          + status_code           = 301
          + subpath_matching      = false
          + target_url            = "https://pascaliske.dev/home"
        }
    }

  # cloudflare_list_item.redirect_legacy_imprint will be created
  + resource "cloudflare_list_item" "redirect_legacy_imprint" {
      + account_id   = "8d679dc8356c467df23c2a56c4f2fb2a"
      + comment      = "/imprint -> /legal-notice"
      + created_on   = (known after apply)
      + id           = (known after apply)
      + list_id      = "834ea16ce6424b70b066002e7f8a5269"
      + modified_on  = (known after apply)
      + operation_id = (known after apply)
      + redirect     = {
          + include_subdomains    = false
          + preserve_path_suffix  = false
          + preserve_query_string = false
          + source_url            = "pascaliske.dev/imprint"
          + status_code           = 301
          + subpath_matching      = false
          + target_url            = "https://pascaliske.dev/legal-notice"
        }
    }

  # cloudflare_list_item.redirect_legacy_privacy will be created
  + resource "cloudflare_list_item" "redirect_legacy_privacy" {
      + account_id   = "8d679dc8356c467df23c2a56c4f2fb2a"
      + comment      = "/privacy -> /legal-notice"
      + created_on   = (known after apply)
      + id           = (known after apply)
      + list_id      = "834ea16ce6424b70b066002e7f8a5269"
      + modified_on  = (known after apply)
      + operation_id = (known after apply)
      + redirect     = {
          + include_subdomains    = false
          + preserve_path_suffix  = false
          + preserve_query_string = false
          + source_url            = "pascaliske.dev/privacy"
          + status_code           = 301
          + subpath_matching      = false
          + target_url            = "https://pascaliske.dev/legal-notice"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Workflow: `Terraform`*